20221118T002048--kdoc-5-fmtを読む__project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-09-03T20:00:22Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 5: fmtを読む</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>

</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 5: fmtを読む</h1>
<p>
fmtは<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>の標準ライブラリの1つで、文字の出力に関する機能を提供する。
</p>

<ul class="org-ul">
<li>まず読む前にどういう機能なのか、どういうオプションがあるのか調べた</li>
<li>ちょいちょい理解が合ってるかコードで実験しながらやる。小さく実験していくなかで、使い方と仕組みの両方で理解が深まる。こうやったらどうなるのだろう、を思いついたりもする</li>
<li>読みつつ、書く</li>
<li>メモを取る</li>
<li>コールグラフで全体像を見る。構造体とそのメソッドの種類をおおまかに把握する</li>
<li>テストを使って関数の使い方を確かめる</li>
<li>デバッガーを使って順に追う</li>
</ul>
<div id="outline-container-org10259b0" class="outline-2">
<h2 id="org10259b0"><a href="#org10259b0">memo</a></h2>
<div class="outline-text-2" id="text-org10259b0">
<p>
printとformatがある。
</p>
</div>
<div id="outline-container-orga663686" class="outline-3">
<h3 id="orga663686"><a href="#orga663686">Stateインターフェース</a></h3>
<div class="outline-text-3" id="text-orga663686">
<div class="org-src-container">
<pre class="src src-go">type State interface {
	Write(b []byte) (n int, err error)
	Width() (wid int, ok bool)
	Precision() (prec int, ok bool)
	Flag(c int) bool
}
</pre>
</div>

<p>
pp構造体がこれを満たしている。
</p>
</div>
</div>
<div id="outline-container-org5286928" class="outline-3">
<h3 id="org5286928"><a href="#org5286928">pp構造体</a></h3>
<div class="outline-text-3" id="text-org5286928">
<p>
ppはプリンターの状態を持つ構造体。
ppはfmtをフィールドに持っている。fmtは構造体で、printfで使われるフォーマッター。各種フラグやwidthを持っている。
</p>

<p>
fmtFlagsは何だ。すべてbooleanだ。widthオプションを持ってるか、precオプション(小数精度)を持っているか。プラス、マイナス、シャープ、スペース、ゼロのフラグがあるな。これらの記号もつけられるオプションだな。%#vとか、%+vとかある。
</p>

<p>
ppに多くのメソッドがついている。
</p>

<p>
widthはfmtのwidthに移譲している。widthはintで、出力する文字列の長さ。
precisionはそういうオプションがあって、小数精度ってことらしい。
</p>
</div>
</div>
<div id="outline-container-orgcd9aa79" class="outline-3">
<h3 id="orgcd9aa79"><a href="#orgcd9aa79">GoStringer</a></h3>
<div class="outline-text-3" id="text-orgcd9aa79">
<p>
型定義したものの出力をするためのものらしい。フォーマット%#vとかで出てくるやつ。実装してみると、%#vはGoString()で上書きされた。%fはどちらも使わない。PrintlnではString()が使用された。
</p>

<div class="org-src-container">
<pre class="src src-go">package main

import (
	"fmt"
)

type test struct {
	Name string
}

func (t test) GoString() string {
	return "this is GoString()"
}

func (t test) String() string {
	return "this is String()"
}

func main() {
	t := test{
		Name: "aaa",
	}

	fmt.Printf("%#v\n", t)
	// this is GoString()

	fmt.Printf("%+f\n", t)
	// {%!f(string=aaa)}

	fmt.Printf("%#f\n", t)
	// {%!f(string=aaa)}

	fmt.Println(t)
	// this is String()
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc5c199a" class="outline-3">
<h3 id="orgc5c199a"><a href="#orgc5c199a">printの種類</a></h3>
<div class="outline-text-3" id="text-orgc5c199a">
<ul class="org-ul">
<li>出力先</li>
<li>フォーマットを取るもの</li>
</ul>

<p>
の組み合わせでいくつかある感じ。
</p>

<p>
それらをちょっと変えて、本質的にはdoPrint()が処理してる。
doPrint()は引数文字列をすべて処理するループをつくり、処理はprintArg()に移譲する。書き込むとは、p.buf.writeByte()することだ。
doPrintln()はdoPrint()の改行する版で、だいたい最後にp.buf.writeByte(&rsquo;\n&rsquo;)が入るだけ。
</p>
</div>
</div>
<div id="outline-container-org6667009" class="outline-3">
<h3 id="org6667009"><a href="#org6667009">fmtとprinter</a></h3>
<div class="outline-text-3" id="text-org6667009">
<p>
ppのメソッドのいくつかは、同名のfmtにある関数へ移譲している。
</p>

<p>
signed integerは符号付き整数。
</p>
</div>
</div>
<div id="outline-container-org3519959" class="outline-3">
<h3 id="org3519959"><a href="#org3519959">多くのfmt{型}関数</a></h3>
<div class="outline-text-3" id="text-org3519959">
<p>
fmtInteger()は長い関数。各オプションの処理をしているように見える。基数の数で分岐したり、プレフィクスによって変えたり。rune型のverbによって条件分岐する。fmtのintegerに移譲する。基数によって引数を変えてる。
float、complex, string&#x2026;。それぞれオプションがあるかで分岐する。実際にbufに書き込みしてるのは、このfmt{型}関数のようだ。で、最終的には、たとえばFprint()の場合は関数内でwriterに書き込んで処理が完了する。途中まではpp構造体のbufフィールドで持っておく。
</p>

<div class="org-src-container">
<pre class="src src-go">func Fprint(w io.Writer, a ...any) (n int, err error) {
        p := newPrinter() 	// *pp型
        p.doPrint(a)              // p.bufにprint結果をセットする
        n, err = w.Write(p.buf)   // writerに書き込み
        p.free()                  // ppをリセット
        return
}
</pre>
</div>

<p>
Fprintfの場合は引数にフォーマット文字列が追加される。
<code>fmt.Fprintf(writer, "Hello, %s", name)</code> みたいな。
</p>

<p>
verbはどうやって渡されるか。例えば%#vの、 <code>v</code> の部分がverbで、 <code>#</code> の部分がオプションぽいな。
</p>

<p>
それらのfmt{型}関数を読んでるのは、printArg()だ。大きなswitch文になっていて、使用するフォーマット関数を振り分ける。printArg()はdoPrint()から呼び出される。doPrint()はFpritf,Sprintf,Sprintなど見たことのある公開メソッドから呼び出される。
</p>
</div>
</div>
<div id="outline-container-org3c0eb8a" class="outline-3">
<h3 id="org3c0eb8a"><a href="#org3c0eb8a">print時の全体の流れ</a></h3>
<div class="outline-text-3" id="text-org3c0eb8a">
<p>
つまりFprintf(),Sprintf()&#x2026; -&gt; doPrint() -&gt; printArg() -&gt; fmtInteger(), fmtString()&#x2026;という感じ。
</p>
</div>
</div>
<div id="outline-container-org2ab8fd3" class="outline-3">
<h3 id="org2ab8fd3"><a href="#org2ab8fd3">printArg()でverbを渡すのはformat系のみ</a></h3>
<div class="outline-text-3" id="text-org2ab8fd3">
<p>
printArg()で、verbを伝播して渡すのはdoPrintf()系のみ。doPrint()では、printArg(arg, &rsquo;v&rsquo;)と固定オプションを指定する扱いになっている。
</p>
</div>
</div>
<div id="outline-container-orgf4e31f0" class="outline-3">
<h3 id="orgf4e31f0"><a href="#orgf4e31f0">doPrint()</a></h3>
<div class="outline-text-3" id="text-orgf4e31f0">
<p>
anyの引数に対してループ回してる。複数引数が渡されたときはそれぞれを表示するからな。
doPrint(&ldquo;aa&rdquo;, &ldquo;bb&rdquo;) だと <code>aa bb</code> みたく1文字空けて表示する。
</p>

<p>
anyの引数に対してループを作り、それぞれに <code>p.printArg(arg, 'v')</code> を実行する。runeは <code>v</code> で固定されている。
</p>
</div>
</div>
<div id="outline-container-org865e636" class="outline-3">
<h3 id="org865e636"><a href="#org865e636">trucateString</a></h3>
<div class="outline-text-3" id="text-org865e636">
<p>
手頃そうな関数を調べてみる。左から数えた文字数で切るtruncateString()。例えば指定文字数が2文字だと、 <code>"aaaa" -&gt; "aa"</code> とするような非常に単純な機能。しかし実装は一見ぱっと見でわかりにくい。最初はスライスの記法だけでいけるように見える。これは桁の方が文字数より多いケースに対応している。普通にスライス記法で書くとindex out of rangeエラーになるだろう。
</p>

<p>
nとiは逆方向にインクリメントが進むので、長さが5だとすると iが <code>0, 1, 2, 3, 4</code> となるとき、nは <code>4, 3, 2, 1, 0</code> となる。nがマイナスの値に突入したとき、iはアクセスできる最大のインデックスを示している。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>単独で実行できるようにコードを書き換えている。本物のコードは桁数や桁数指定フラグを渡す</label><pre class="src src-go">func truncateString(s string, b bool) string {
        if b {
                n := 5
                for i := range s {
                        n--
                        if n &lt; 0 {
                                return s[:i]
                        }
                }
        }
        return s
}

func main() {
        fmt.Println("aaa"[:2]) // aa
        // fmt.Println("aaa"[:5]) // これはエラーになる
        fmt.Println(truncateString("aaaiiiuuu", true)) // aaaii
        fmt.Println(truncateString("aaa", true))       // aaa
        fmt.Println(truncateString("", true))	   // ""
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9a9f69a" class="outline-3">
<h3 id="org9a9f69a"><a href="#org9a9f69a">truncate(バイト列バージョン)</a></h3>
<div class="outline-text-3" id="text-org9a9f69a">
<p>
バイト列バージョン。文字エンコードが絡むのでちょっと処理が増えるが基本は同じ。
</p>

<p>
バイト列の初期化方法。シングルクォートを使うか、あるいは[]byte(&ldquo;文字列&rdquo;)で初期化するのがわかりやすい。
utf8.RuneSelfは整数128のエイリアス。utf8エンコードの基本の数になる。8ビット=1バイト(256通り)として1文字分。128を超えると2バイトになる。
</p>

<div class="org-src-container">
<pre class="src src-go">// rune, sizeを返す
fmt.Println(utf8.DecodeRune([]byte("a"))) // 97 1
fmt.Println(utf8.DecodeRune([]byte("¶"))) // 182 2
fmt.Println(utf8.DecodeRune([]byte("あ"))) // 12354 3
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>単独で実行できるように改変</label><pre class="src src-go">func truncate(b []byte) []byte {
        if true {
                n := 5 // ここは小数精度設定で注入される
                for i := 0; i &lt; len(b); {
                        n--
                        if n &lt; 0 {
                                return b[:i]
                        }
                        wid := 1
                        if b[i] &gt;= utf8.RuneSelf {
                                _, wid = utf8.DecodeRune(b[i:])
                        }
                        // 文字のバイト数分ループを飛ばす
                        i += wid
                }
        }
        return b
}

func main() {
        test := []byte("abcdefg")
        fmt.Println(test, truncate(test)) // truncateされる
        nihon := []byte("日本語日本語")
        fmt.Println(len(nihon), len(truncate(nihon))) // 18 -&gt; 15
        // 3バイト文字が5個にtruncateされることで、バイト数が15になる
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org4bd5013" class="outline-3">
<h3 id="org4bd5013"><a href="#org4bd5013">precisionの指定方法</a></h3>
<div class="outline-text-3" id="text-org4bd5013">
<p>
小数精度の指定方法。
</p>

<div class="org-src-container">
<pre class="src src-go">fmt.Printf("%.9s", 4) # -&gt; %!s(int=000000004)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc71b06" class="outline-3">
<h3 id="orgbc71b06"><a href="#orgbc71b06">フォーマットの対応付けはどうやってるか</a></h3>
<div class="outline-text-3" id="text-orgbc71b06">
<p>
フォーマットを解釈するところはわかったが、対応づけてフォーマット文字の部分に文字列を加えている部分がよくわかってない。
</p>

<p>
doPrintf(format: string, a: any)みたいな感じで呼ばれる。
</p>
</div>
</div>
<div id="outline-container-orgc0ee5e4" class="outline-3">
<h3 id="orgc0ee5e4"><a href="#orgc0ee5e4">それぞれの構造体の役割</a></h3>
<div class="outline-text-3" id="text-orgc0ee5e4">
<ul class="org-ul">
<li>pp(print.go)</li>
<li>fmt(format.go) ppに埋め込まれる構造体。fmt{型}系メソッドがある</li>
<li>buffer(print.go) bufferへの大きな依存を防ぐため、シンプルにbyteで実装している</li>
<li>ss(scan.go)</li>
</ul>
</div>
</div>
<div id="outline-container-orgdbb0ec5" class="outline-3">
<h3 id="orgdbb0ec5"><a href="#orgdbb0ec5">表示の意味</a></h3>
<div class="outline-text-3" id="text-orgdbb0ec5">
<p>
os.Stdout(/dev/stdout)に書き込むのが、表示の意味。
結果がすべて出るまでは一時的にpp.bufに入れておき、一気にos.Stdoutに書き込んで表示する。
</p>

<p>
一見println()とファイルは関係なさそうだが、実行するたびにファイル書き込みを行っている。
</p>
</div>
</div>
<div id="outline-container-orgb70293b" class="outline-3">
<h3 id="orgb70293b"><a href="#orgb70293b">References</a></h3>
<div class="outline-text-3" id="text-orgb70293b">
<p>
読む解くのに文字コード系やバイトに関する知識が必要だった。
</p>

<ul class="org-ul">
<li><a href="https://qiita.com/seihmd/items/4a878e7fa340d7963fee">Goのruneを理解するためのUnicode知識 - Qiita</a></li>
<li><a href="https://qiita.com/catatsuy/items/bccc2c76be501e98382a">utf8としてvalidなバイト列を判定する方法をGoから見る - Qiita</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
